app/controllers/movies_controller.rb

  def index

    if params.has_key? :sort_by
      if params[:sort_by] == 'title'
        @sort_by_title = true
        @sort_by_release_date = false
        @movies = Movie.sort_by_title
      elsif params[:sort_by] == 'release_date'
        @sort_by_title = false
        @sort_by_release_date = true
        @movies = Movie.sort_by_release_date
      end
    else
      @sort_by_title = false
      @sort_by_release_date = false
      @movies = Movie.all
---
SELECT "movies".* FROM "movies"